
SELECT 
    Н_УЧЕНИКИ.ГРУППА AS "номер группы",
    Н_ЛЮДИ.ИД AS "номер студента",
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО,
    Н_УЧЕНИКИ.П_ПРКОК_ИД AS "номер пункта приказа",
    Н_УЧЕНИКИ.СОСТОЯНИЕ
FROM 
    Н_УЧЕНИКИ
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
WHERE 

    Н_ПЛАНЫ.ФО_ИД IN (
        SELECT ИД 
        FROM Н_ФОРМЫ_ОБУЧЕНИЯ 
        WHERE НАИМЕНОВАНИЕ LIKE '%заочн%'
    )
    AND Н_ПЛАНЫ.КУРС = 1
    AND Н_УЧЕНИКИ.НАЧАЛО >= '2012-09-01'
    AND Н_УЧЕНИКИ.НАЧАЛО < '2012-09-02'
ORDER BY 
    Н_УЧЕНИКИ.ГРУППА, 
    Н_ЛЮДИ.ФАМИЛИЯ;


-- Diagnostic
SELECT COUNT(*) 
FROM Н_УЧЕНИКИ 
WHERE НАЧАЛО >= '2012-09-01' AND НАЧАЛО < '2012-09-02';
